{
  "filmes": [
    {
      "id": 1,
      "titulo": "Pantera Negra: Wakanda Para Sempre",
      "descricao": "Em Wakanda, a Rainha Ramonda, Shuri, M'Baku, Okoye e as Dora Milaje lutam para proteger a sua nação de potências mundiais, na sequência da morte do rei T'Challa. Enquanto os Wakandianos se esforçam para abraçar o próximo capítulo, os heróis unem-se com a ajuda de War Dog Nakia e Everett Ross para descobrirem um novo caminho para o reino de Wakanda.",
      "genero": "Aventura",
      "sala_id": "3",
      "secao_id": "2",
      "cartaz": "https://s2.glbimg.com/CV473j0T17G1kNT369lbJ_jJKSE=/0x0:743x1100/984x0/smart/filters:strip_icc()/i.s3.glbimg.com/v1/AUTH_ba3db981e6d14e54bb84be31c923b00c/internal_photos/bs/2022/A/A/tUlOuNRDGBdBhUaBgGtg/wakanda.png"
    },
    {
      "id": 2,
      "titulo": "Adão Negro",
      "descricao": "Nascido no Egito Antigo, o anti-herói tem super força, velocidade, resistência, capacidade de voar e de disparar raios. Alter ego de Teth-Adam e filho do faraó Ramsés II, Adão Negro foi consumido por poderes mágicos e transformado em um feiticeiro. Grande inimigo de Shazam! nas HQs, apesar dele acreditar em seu pontecial e, inclusive, oferecê-lo como um guerreiro do bem, Adão Negro acaba usando suas habilidades especiais para o mal. O anti-herói em busca de redenção ou um herói que se tornou vilão, pode ser capaz de destruir tudo o que estiver pela frente - ou de encontrar seu caminho.",
      "genero": "Ação",
      "sala_id": "3",
      "secao_id": "2",
      "cartaz": "https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcSrULQHUpm3Zr60AXFAltaQkpo6DAe8FZmhSrYsa7t5DCUeaeF9"
    },
    {
      "id": 3,
      "titulo": "One Piece Film: Red",
      "descricao": "Em ONE PIECE FILM RED todos conhecerão Uta, a cantora mais amada do planeta, cuja voz foi descrita como `de outro mundo´. Ela é conhecida por esconder sua própria identidade ao se apresentar. Agora, pela primeira vez, Uta se revelará ao mundo em um show ao vivo. Com a Marinha assistindo de perto, o local se enche de fãs de Uta - incluindo piratas animados e os Chapéus de Palha liderados por Luffy, que vieram para curtir sua performance - todos aguardam ansiosamente a voz que o mundo inteiro estava esperando. A história começa com a chocante revelação de que ela é a enigmática filha de Shanks.",
      "genero": "Animação",
      "sala_id": "2",
      "secao_id": "1",
      "cartaz": "https://www.google.com/url?sa=i&url=https%3A%2F%2Fonepiecefilmredbrasil.com.br%2F&psig=AOvVaw1iKgDgxpl5K7K-zPsVn2K2&ust=1667649638884000&source=images&cd=vfe&ved=0CAoQjRxqFwoTCMiE4pW9lPsCFQAAAAAdAAAAABAD"
    },
    {
      "id": 4,
      "titulo": "Ingresso para o paraíso",
      "descricao": "A passeio em Bali com a amiga Wren (Billie Lourd), a jovem Lily (Kaitlyn Dever) surpreende a todos ao decidir se casar com um jovem balinês. A novidade cai como uma bomba no colo de sua mãe (Julia Roberts) e de seu pai (George Clooney). Afinal, os dois são divorciados há muito tempo, não se dão bem, e sabem exatamente o que significa casar de uma hora para a outra. Por acreditarem que a filha está prestes a cometer o mesmo erro, os dois decidem formar uma aliança para evitar que o casamento aconteça. Só que o plano tem tudo para dar errado e a confusão não tem data e nem hora marcada.",
      "genero": "Romance",
      "sala_id": "4",
      "secao_id": "1",
      "cartaz": "https://br.web.img2.acsta.net/pictures/22/09/06/20/33/1565110.jpg"
    },
    {
      "id": 5,
      "titulo": "Não se preocupe, querida",
      "descricao": "O casal Alice (Florence Pugh) e Jack (Harry Styles) mora numa cidade experimental do ultrassecreto Projeto Vitória. A vida nesta comunidade planejada da década de 1950 é, praticamente, perfeita. Todas as necessidades dos moradores são atendidas pela empresa. A única contrapartida, não negociável, exigida é a discrição, como lembra um dos líderes (Chris Pine). Quando o mistério passa a incomodar alguns vizinhos e muitas dúvidas são deixadas no ar, Alice acredita que eles precisam ir embora dali. Só que essa escolha pode não ser tão simples.",
      "genero": "Drama",
      "sala_id": "2",
      "secao_id": "1",
      "cartaz": "https://portalpopline.com.br/wp-content/uploads/2022/09/FcjB3qeXoAAl1wt-640x800.jpg"
    },
    {
      "id": 6,
      "titulo": "A órfã 2: A origem",
      "descricao": "Leena (Isabelle Fuhrman) consegue fugir de uma clínica psiquiátrica, na Europa. Ao fingir ser Esther, filha de um casal rico, desaparecida há quatro anos, ela consegue viajar para os Estados Unidos. Lá, é recebida com muita alegria e carinho pela nova família. Sob os cuidados especiais de uma psicóloga, Leena não demora muito para demonstrar um estranho comportamento. Enquanto isso, após investigar o passado recente da jovem, um detetive faz uma descoberta sinistra. Ao mesmo tempo, sua mãe (Julia Stiles) percebe algo de assustador nela e adota uma postura defensiva diante de um possível perigo.",
      "genero": "Terror",
      "sala_id": "1",
      "secao_id": "2",
      "cartaz": "https://s2.glbimg.com/CV473j0T17G1kNT369lbJ_jJKSE=/0x0:743x1100/984x0/smart/filters:strip_icc()/i.s3.glbimg.com/v1/AUTH_ba3db981e6d14e54bb84be31c923b00c/internal_photos/bs/2022/A/A/tUlOuNRDGBdBhUaBgGtg/wakanda.png"
    },
    {
      "id": 7,
      "titulo": "DC Liga dos Pets",
      "descricao": "O super-cão Kripto e o inseparável amigo Super-Homem combatem o crime na cidade de Metrópolis. Quando o Superman e os membros da Liga da Justiça estão em perigo nas mãos de um terrível vilão, Kripto precisa fazer alguma coisa. E é o que ele irá tentar ao lado de um atrapalhado bando de animais de um abrigo, agora, com superpoderes ainda não totalmente dominados. Prepare-se para conhecer uma intrépida e poderosa trupe animal em missão de resgate dos amigos da lei. Parece que essa missão tem tudo para dar errado, mas promete ser pra lá de divertida.",
      "genero": "Animação",
      "sala_id": "2",
      "secao_id": "2",
      "cartaz": "https://www.shoppingcidadedasflores.com.br/wp-content/uploads/sites/244/2022/08/DC-Liga-dos-Superpets.jpg"
    },
    {
      "id": 8,
      "titulo": "Moonage Daydream",
      "descricao": "Prepare-se para uma jornada criativa pela carreira do cantor David Bowie através da música e das artes, como cinema, dança, pintura, teatro, entre outras. Exibido no Festival de Cannes 2022, o filme mostra a vida e a personalidade do icônico artista com direito a versões ao vivo, inéditas, trechos de entrevistas, e novas versões de clássicos. Os fãs poderão conferir a versão ao vivo da clássica The Jean Genie com Love Me Do, dos Beatles, e com Jeff Beck na guitarra. Space Oddity, Modern Love, Let?s Dance e a faixa que dá nome ao filme estão entre as canções que serão ouvidas.",
      "genero": "Documentário",
      "sala_id": "4",
      "secao_id": "1",
      "cartaz": "https://s2.glbimg.com/CV473j0T17G1kNT369lbJ_jJKSE=/0x0:743x1100/984x0/smart/filters:strip_icc()/i.s3.glbimg.com/v1/AUTH_ba3db981e6d14e54bb84be31c923b00c/internal_photos/bs/2022/A/A/tUlOuNRDGBdBhUaBgGtg/wakanda.png"
    },
    {
      "id": 9,
      "titulo": "Sorria",
      "descricao": "Rose Cotter (Sosie Bacon) é uma psiquiatra dedicada. Depois de testemunhar a misteriosa e assustadora morte de uma paciente (Caitlin Stasey), ela fica obcecada com a ideia de que precisa encontrar uma explicação. A resposta pode estar em um sorriso fixo e ameaçador relatado pela vítima. Só que ao investigar o enigma, Rose passa a vivenciar experiências perturbadoras. E quando Joel (Kyle Gallner) relata a existência de várias mortes relacionadas ao recente acontecimento, tudo indica que ela será a próxima e tem pouco tempo para enfrentar e vencer essa força maligna.",
      "genero": "Terror",
      "sala_id": "1",
      "secao_id": "2",
      "cartaz": "https://br.web.img3.acsta.net/pictures/22/09/20/15/51/1507365.jpg"
    },
    {
      "id": 10,
      "titulo": "Lilo, Lilo Crocodilo",
      "descricao": "Novos moradores de um prédio, a família Primm conheceu Hector Valenti (Javier Bardem). E ele seria um vizinho qualquer não fosse o fato dele dividir a moradia com Lilo, um crocodilo. Enquanto a Sra. Primm (Constance Wu) ficou enlouquecida com a novidade, seu filho está encantado com o simpático réptil que adora conversar e canta como ninguém. O problema é que tem gente na vizinhança disposta a tudo para ver as lágrimas do crocodilo. Adaptação do livro do premiado Bernard Waber, autor de uma série de publicações com o amado personagem. O cantor Shawn Mendes dá a voz ao talentoso réptil na versão original.",
      "genero": "Comédia",
      "sala_id": "1",
      "secao_id": "2",
      "cartaz": "https://cinemaeafins.com.br/wp-content/uploads/2022/09/Lilo-Lilo-Crocodilo-poster-2.jpg"
    }
  ],

  "sala": [
    {
      "id": 1,
      "sala": "1",
      "assentos": "48"
    },
    {
      "id": 2,
      "sala": "2",
      "assentos": "50"
    },
    {
      "id": 3,
      "sala": "3",
      "assentos": "68"
    },
    {
      "id": 4,
      "sala": "4",
      "assentos": "45"
    }
  ],

  "secao": [
    {
      "id": 1,
      "nome": "Legendado",
      "tela": "2D"
    },
    {
      "id": 2,
      "nome": "Dublado",
      "tela": "3D"
    }
  ]
}